Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДальнейшиеДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продолжить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/МониторингНедоступногоСервисаOneScriptАИТП/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
//
// Обработчики действий бизнес-процесса МониторингНедоступногоСервисаOneScriptАИТП
//
//////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - обработчик действия ПроверитьДоступностьСервисаOneScript
//
// Параметры:
//  ТочкаМаршрута  - БизнесПроцессы.МониторингНедоступногоСервисаOneScriptАИТП.ТочкиМаршрута.ПроверитьДоступностьСервисаOneScript - точка маршрута действия
//  Задача  - ЗадачаСсылка.ЗадачаАИТП - Ссылка на выполняемую задачу
//  ПараметрыВыполнения  - Соответствие - параметры выполнения
//
Процедура ПроверитьДоступностьСервисаOneScript(ТочкаМаршрута, Задача, ПараметрыВыполнения) Экспорт
	// Вставить содержимое обработчика.
	БизнесПроцесс = Задача.БизнесПроцесс;
	
	Результат = МониторингДоступностиСервисовOneScriptАИТП.ВыполнитьТесты(БизнесПроцесс.Сервис);
	Задача.ОписаниеРезультата = МониторингДоступностиСервисовOneScriptАИТП.СформироватьОтчетПоРезультатамТестов(Результат);
	
	Если Результат.БылиОшибки = Истина Тогда
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный;
	Иначе
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Положительный;
	КонецЕсли;
	
	Задача.ДальнейшиеДействия = Перечисления.ДальнейшиеДействияАИТП.Продолжить;
	Задача.Записать();
	
КонецПроцедуры

#КонецОбласти
